cylinder/gmsh/1ms/constant/oversetMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      oversetMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

interpolation
{
    interpolationSchemes (inverseDistance);

    default inverseDistance;
}

// Names or patches that determine hole cells
holePatches  (wall);

regions
(
    volume
    {
        // Donor regions
        donorRegions ( internal );

        fringe
        {
            type overlap;

            suitablePairFraction 0.5;
            cacheFringe          no;

            donorSuitability
            {
                type      noSuitability;
                threshold 1;
            }
        }
    }

    internal
    {
        donorRegions ( volume );

        fringe
        {
            type faceCells;
            patches (cylinder);
        }
    }
);


// ************************************************************************* //
